In [31]:
import numpy as np
import pandas as pd

In [32]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [33]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [34]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [35]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [36]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

## Working with dates

In [37]:
date['date'] = pd.to_datetime(date['date'])

In [38]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

### 1. Extract year

In [39]:
date['date_year'] = date['date'].dt.year

In [40]:
date.head()

        date  product_id  city_id  orders  date_year
0 2019-12-10        5628       25       3       2019
1 2018-08-15        3646       14     157       2018
2 2018-10-23        1859       25       1       2018
3 2019-08-17        7292       25       1       2019
4 2019-01-06        4344       25       3       2019

### 2. Extract month

In [41]:
date['date_month_no'] = date['date'].dt.month

In [42]:
date['date_month_name'] = date['date'].dt.month_name()

In [43]:
date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name
0,2019-12-10,5628,25,3,2019,12,December
1,2018-08-15,3646,14,157,2018,8,August
2,2018-10-23,1859,25,1,2018,10,October
3,2019-08-17,7292,25,1,2019,8,August
4,2019-01-06,4344,25,3,2019,1,January

### 3. Extract days

In [44]:
date['date_day'] = date['date'].dt.day

In [45]:
date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day
0,2019-12-10,5628,25,3,2019,12,December,10
1,2018-08-15,3646,14,157,2018,8,August,15
2,2018-10-23,1859,25,1,2018,10,October,23
3,2019-08-17,7292,25,1,2019,8,August,17
4,2019-01-06,4344,25,3,2019,1,January,6

### 4. Extract week of date

In [46]:
date['date_dow'] = date['date'].dt.dayofweek

In [47]:
date['date_dow_name'] = date['date'].dt.day_name()

In [48]:
date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday

In [49]:
# is weekend
date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday','Saturday']), 1, 0)
date.drop(columns=['product_id', 'city_id', 'orders'],inplace=True)

In [50]:
date.head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend
0,2019-12-10,2019,12,December,10,1,Tuesday,0
1,2018-08-15,2018,8,August,15,2,Wednesday,0
2,2018-10-23,2018,10,October,23,1,Tuesday,0
3,2019-08-17,2019,8,August,17,5,Saturday,1
4,2019-01-06,2019,1,January,6,6,Sunday,1

### 5. Extract week of the year

In [51]:
date['date_week'] = date['date'].dt.week

C:\Users\Mayank\AppData\Local\Temp\ipykernel_15280\3869037006.py:1: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated. Please use Series.dt.isocalendar().week instead.
  date['date_week'] = date['date'].dt.week

In [52]:
date.head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43
3,2019-08-17,2019,8,August,17,5,Saturday,1,33
4,2019-01-06,2019,1,January,6,6,Sunday,1,1

## 6. Extract quarter

In [53]:
date['quarter'] = date['date'].dt.quarter

In [54]:
date.head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4
3,2019-08-17,2019,8,August,17,5,Saturday,1,33,3
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1

### 7. Extract semister

In [55]:
date['semester'] = np.where(date['quarter'].isin([1,2]), 1, 2)

In [56]:
date.head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter,semester
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4,2
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3,2
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4,2
3,2019-08-17,2019,8,August,17,5,Saturday,1,33,3,2
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1,1

### 8. Extract time elapsed between dates

In [57]:
import datetime

today = datetime.datetime.today()
today

datetime.datetime(2024, 10, 7, 19, 35, 5, 703384)

In [58]:
today - date['date']

0     1763 days 19:35:05.703384
1     2245 days 19:35:05.703384
2     2176 days 19:35:05.703384
3     1878 days 19:35:05.703384
4     2101 days 19:35:05.703384
                 ...
995   2191 days 19:35:05.703384
996   2132 days 19:35:05.703384
997   1980 days 19:35:05.703384
998   2045 days 19:35:05.703384
999   1819 days 19:35:05.703384
Name: date, Length: 1000, dtype: timedelta64[ns]

In [60]:
(today - date['date']).dt.days

0      1763
1      2245
2      2176
3      1878
4      2101
       ...
995    2191
996    2132
997    1980
998    2045
999    1819
Name: date, Length: 1000, dtype: int64

In [61]:
# month passed
np.round((today - date['date']) / np.timedelta64(1,'M'), 0)

0      58.0
1      74.0
2      72.0
3      62.0
4      69.0
       ...
995    72.0
996    70.0
997    65.0
998    67.0
999    60.0
Name: date, Length: 1000, dtype: float64

## Working with time

In [62]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [63]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [64]:
time['date'] = pd.to_datetime(time['date'])

In [66]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

### 1. Extract hours, minutes and seconds

In [68]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

In [69]:
time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

### 3. Extract time part

In [70]:
time['time'] = time['date'].dt.time

In [71]:
time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

In [72]:
# time difference
today - time['date']

0     3949 days 18:45:05.703384
1     3813 days 19:55:05.703384
2     4299 days 19:14:05.703384
3     3601 days 19:04:05.703384
4     3998 days 20:24:05.703384
                 ...
995   4588 days 18:45:05.703384
996   3909 days 20:21:05.703384
997   4374 days 19:58:05.703384
998   4490 days 20:01:05.703384
999   3762 days 20:10:05.703384
Name: date, Length: 1000, dtype: timedelta64[ns]

In [73]:
# in seconds
(today - time['date'])/np.timedelta64(1,'s')

0      3.412611e+08
1      3.295149e+08
2      3.715028e+08
3      3.111950e+08
4      3.455006e+08
           ...
995    3.964707e+08
996    3.378109e+08
997    3.779855e+08
998    3.880081e+08
999    3.251094e+08
Name: date, Length: 1000, dtype: float64

In [74]:
# in seconds
(today - time['date'])/np.timedelta64(1,'h')

0       94794.751584
1       91531.918251
2      103195.234918
3       86443.068251
4       95972.401584
           ...
995    110130.751584
996     93836.351584
997    104995.968251
998    107780.018251
999     90308.168251
Name: date, Length: 1000, dtype: float64

In [75]:
# in minutes
(today - time['date'])/np.timedelta64(1,'m')

0      5.687685e+06
1      5.491915e+06
2      6.191714e+06
3      5.186584e+06
4      5.758344e+06
           ...
995    6.607845e+06
996    5.630181e+06
997    6.299758e+06
998    6.466801e+06
999    5.418490e+06
Name: date, Length: 1000, dtype: float64